libs/nx_onvif/src/xml/ImagingBinding.SetImagingSettings.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsdd5="http://tempuri.org/wsdd5.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:onvifAnalytics-aeb="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding"
    xmlns:onvifAnalytics-reb="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding"
    xmlns:onvifAnalytics="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:onvifDevice="http://www.onvif.org/ver10/device/wsdl"
    xmlns:onvifDeviceIO="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:onvifEvents-cpb="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding"
    xmlns:onvifEvents-eb="http://www.onvif.org/ver10/events/wsdl/EventBinding"
    xmlns:onvifEvents-ncb="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding"
    xmlns:onvifEvents-npb="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding"
    xmlns:onvifEvents-ppb="http://www.onvif.org/ver10/events/wsdl/PullPointBinding"
    xmlns:onvifEvents="http://www.onvif.org/ver10/events/wsdl"
    xmlns:onvifEvents-pps="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding"
    xmlns:onvifEvents-psmb="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:onvifEvents-smb="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding"
    xmlns:onvifImg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:onvifMedia="http://www.onvif.org/ver10/media/wsdl"
    xmlns:onvifMedia2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:onvifNetwork-dlb="http://www.onvif.org/ver10/network/wsdl/DiscoveryLookupBinding"
    xmlns:onvifNetwork-rdb="http://www.onvif.org/ver10/network/wsdl/RemoteDiscoveryBinding"
    xmlns:onvifNetwork="http://www.onvif.org/ver10/network/wsdl"
    xmlns:onvifPtz="http://www.onvif.org/ver20/ptz/wsdl">
 <!-- struct SOAP_ENV__Header *soap::header -->
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <!-- __onvifImg__SetImagingSettings(..., _onvifImg__SetImagingSettings *onvifImg__SetImagingSettings, ...) -->
   <!-- _onvifImg__SetImagingSettings *onvifImg__SetImagingSettings -->
   <onvifImg:SetImagingSettings>
    <!-- std::string VideoSourceToken -->
    <onvifImg:VideoSourceToken></onvifImg:VideoSourceToken>
    <!-- tt__ImagingSettings20 *ImagingSettings -->
    <onvifImg:ImagingSettings>
     <!-- tt__BacklightCompensation20 *BacklightCompensation -->
     <tt:BacklightCompensation>
      <!-- tt__BacklightCompensationMode Mode -->
      <tt:Mode>OFF</tt:Mode>
      <!-- float *Level -->
      <tt:Level>0.0</tt:Level>
     </tt:BacklightCompensation>
     <!-- float *Brightness -->
     <tt:Brightness>0.0</tt:Brightness>
     <!-- float *ColorSaturation -->
     <tt:ColorSaturation>0.0</tt:ColorSaturation>
     <!-- float *Contrast -->
     <tt:Contrast>0.0</tt:Contrast>
     <!-- tt__Exposure20 *Exposure -->
     <tt:Exposure>
      <!-- tt__ExposureMode Mode -->
      <tt:Mode>AUTO</tt:Mode>
      <!-- tt__ExposurePriority *Priority -->
      <tt:Priority>LowNoise</tt:Priority>
      <!-- tt__Rectangle *Window -->
      <tt:Window bottom="0.0" top="0.0" right="0.0" left="0.0">
      </tt:Window>
      <!-- float *MinExposureTime -->
      <tt:MinExposureTime>0.0</tt:MinExposureTime>
      <!-- float *MaxExposureTime -->
      <tt:MaxExposureTime>0.0</tt:MaxExposureTime>
      <!-- float *MinGain -->
      <tt:MinGain>0.0</tt:MinGain>
      <!-- float *MaxGain -->
      <tt:MaxGain>0.0</tt:MaxGain>
      <!-- float *MinIris -->
      <tt:MinIris>0.0</tt:MinIris>
      <!-- float *MaxIris -->
      <tt:MaxIris>0.0</tt:MaxIris>
      <!-- float *ExposureTime -->
      <tt:ExposureTime>0.0</tt:ExposureTime>
      <!-- float *Gain -->
      <tt:Gain>0.0</tt:Gain>
      <!-- float *Iris -->
      <tt:Iris>0.0</tt:Iris>
     </tt:Exposure>
     <!-- tt__FocusConfiguration20 *Focus -->
     <tt:Focus AFMode="">
      <!-- tt__AutoFocusMode AutoFocusMode -->
      <tt:AutoFocusMode>AUTO</tt:AutoFocusMode>
      <!-- float *DefaultSpeed -->
      <tt:DefaultSpeed>0.0</tt:DefaultSpeed>
      <!-- float *NearLimit -->
      <tt:NearLimit>0.0</tt:NearLimit>
      <!-- float *FarLimit -->
      <tt:FarLimit>0.0</tt:FarLimit>
      <!-- tt__FocusConfiguration20Extension *Extension -->
      <tt:Extension>
       <!-- std::vector<struct soap_dom_element> __any -->
       <!-- a repetition of 0 or more of the following -->

      </tt:Extension>
     </tt:Focus>
     <!-- tt__IrCutFilterMode *IrCutFilter -->
     <tt:IrCutFilter>ON</tt:IrCutFilter>
     <!-- float *Sharpness -->
     <tt:Sharpness>0.0</tt:Sharpness>
     <!-- tt__WideDynamicRange20 *WideDynamicRange -->
     <tt:WideDynamicRange>
      <!-- tt__WideDynamicMode Mode -->
      <tt:Mode>OFF</tt:Mode>
      <!-- float *Level -->
      <tt:Level>0.0</tt:Level>
     </tt:WideDynamicRange>
     <!-- tt__WhiteBalance20 *WhiteBalance -->
     <tt:WhiteBalance>
      <!-- tt__WhiteBalanceMode Mode -->
      <tt:Mode>AUTO</tt:Mode>
      <!-- float *CrGain -->
      <tt:CrGain>0.0</tt:CrGain>
      <!-- float *CbGain -->
      <tt:CbGain>0.0</tt:CbGain>
      <!-- tt__WhiteBalance20Extension *Extension -->
      <tt:Extension>
       <!-- std::vector<struct soap_dom_element> __any -->
       <!-- a repetition of 0 or more of the following -->

      </tt:Extension>
     </tt:WhiteBalance>
     <!-- tt__ImagingSettingsExtension20 *Extension -->
     <tt:Extension>
      <!-- std::vector<struct soap_dom_element> __any -->
      <!-- a repetition of 0 or more of the following -->

      <!-- tt__ImageStabilization *ImageStabilization -->
      <tt:ImageStabilization>
       <!-- tt__ImageStabilizationMode Mode -->
       <tt:Mode>OFF</tt:Mode>
       <!-- float *Level -->
       <tt:Level>0.0</tt:Level>
       <!-- tt__ImageStabilizationExtension *Extension -->
       <tt:Extension>
        <!-- std::vector<struct soap_dom_element> __any -->
        <!-- a repetition of 0 or more of the following -->

       </tt:Extension>
      </tt:ImageStabilization>
      <!-- tt__ImagingSettingsExtension202 *Extension -->
      <tt:Extension>
       <!-- std::vector<tt__IrCutFilterAutoAdjustment *> IrCutFilterAutoAdjustment -->
       <!-- a repetition of 0 or more of the following -->
       <tt:IrCutFilterAutoAdjustment>
        <!-- std::string BoundaryType -->
        <tt:BoundaryType></tt:BoundaryType>
        <!-- float *BoundaryOffset -->
        <tt:BoundaryOffset>0.0</tt:BoundaryOffset>
        <!-- LONG64 *ResponseTime -->
        <tt:ResponseTime>PT0S</tt:ResponseTime>
        <!-- tt__IrCutFilterAutoAdjustmentExtension *Extension -->
        <tt:Extension>
        </tt:Extension>
       </tt:IrCutFilterAutoAdjustment>
       <!-- tt__ImagingSettingsExtension203 *Extension -->
       <tt:Extension>
        <!-- tt__ToneCompensation *ToneCompensation -->
        <tt:ToneCompensation>
         <!-- std::string Mode -->
         <tt:Mode></tt:Mode>
        </tt:ToneCompensation>
        <!-- tt__Defogging *Defogging -->
        <tt:Defogging>
         <!-- std::string Mode -->
         <tt:Mode></tt:Mode>
        </tt:Defogging>
        <!-- tt__NoiseReduction *NoiseReduction -->
        <tt:NoiseReduction>
         <!-- float Level -->
         <tt:Level>0.0</tt:Level>
        </tt:NoiseReduction>
        <!-- tt__ImagingSettingsExtension204 *Extension -->
        <tt:Extension>
        </tt:Extension>
       </tt:Extension>
      </tt:Extension>
     </tt:Extension>
    </onvifImg:ImagingSettings>
    <!-- bool *ForcePersistence -->
    <onvifImg:ForcePersistence>false</onvifImg:ForcePersistence>
   </onvifImg:SetImagingSettings>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
